PascalAI2024/JarvisNano/sdkconfig.defaults
# SPDX-License-Identifier: Apache-2.0
#
# JarvisRobot v5 — project sdkconfig defaults (plain IDF; the ONE source of
# truth, unlike v4 where the board's sdkconfig.defaults.board was inert and the
# real values lived in a bootstrap.sh heredoc). Every line traces to a
# hardware.md non-negotiable.

# --- Target: ESP32-S3, dual-core LX7 @ 240 MHz ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- Flash: 16 MB @ 80 MHz, DIO mode. CO5300 QSPI display forces DIO; default
#     QIO has caused boot failures (hardware.md #4). Also baked into the flash
#     script as belt-and-suspenders. ---
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- PSRAM: 8 MB OCTAL @ 80 MHz, DMA-capable. Internal SRAM is the scarce
#     resource, not PSRAM — large buffers/queues go here (hardware.md #7). ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- XIP from PSRAM: tried 2026-08-27 (factory-demo technique), REVERTED the
#     same day. It moves .text/.rodata into PSRAM so flash writes don't stall
#     execution — but costs ~1.6 MB of PSRAM, and with WakeNet's buffers on
#     board the live device bottomed out at ~400 KB free PSRAM: the display
#     snapshot mirror (434 KB) could no longer allocate. PSRAM headroom for
#     voice + wake + diagnostics outranks the stall polish. Re-evaluate only
#     with a measured stall problem and a PSRAM budget to spend. ---
# CONFIG_SPIRAM_FETCH_INSTRUCTIONS is not set
# CONFIG_SPIRAM_RODATA is not set
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set

# --- Wi-Fi IRAM opts OFF: ~30 KB of internal RAM back. These pin Wi-Fi hot
#     paths into IRAM for peak throughput; the Gemini voice stream is ~100 KB/s
#     and nowhere near that regime, while WakeNet's ~20 KB scratch pushed the
#     internal budget into task/TLS allocation failures (measured: esp-aes
#     "Failed to allocate memory" on the WSS handshake). Demoted Wi-Fi code
#     runs from flash cache — plenty for this stream rate.
#     NOTE: flipping these requires RECONFIGURE=1 (build-toolchain.md — a stale
#     sdkconfig silently keeps existing symbol values). ---
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# --- External task stacks: sampler, touch, tools, and websocket workers are
#     task-context code and must live in PSRAM. Keep their stacks out of the
#     DMA-constrained internal heap reserved for voice, codec, and TLS AES. ---
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# --- Partition table: hand-written 16 MB CSV, NO heredoc/codegen (hardware.md
#     #8). Table ends flush at 0x1000000. ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16MB.csv"

# --- Wake word: esp-sr WakeNet9 "Jarvis" (wn9_jarvis_tts, bundled in the
#     pinned esp-sr 2.4.6). Selecting the model makes esp-sr pack srmodels.bin
#     and flash it to the `model` partition; at runtime it is mmapped XIP from
#     flash (no RAM copy — ~16-20 KB internal scratch only). jr_wake feeds it
#     the AEC-clean 16 kHz frames while the rest ladder has voice disarmed, so
#     "Jarvis" wakes WHISPER/DREAM by voice (Phase 5 gate). ---
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_WN_WN9_JARVIS_TTS=y

# --- Compiler: -O2 perf. The AMOLED/emote path is timing-sensitive; -O0 makes
#     correct rendering look broken (hardware.md #6). ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- Console: native USB-Serial/JTAG over the flash cable. Single-owner — no
#     component may install the USB-serial driver before the console
#     (hardware.md #11). Without this the board enumerates JTAG-only. ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Boot composition root: board/network/audio/display construction plus the
#     embedded diagnostics shell no longer fits IDF's 3.5 KB main-task default.
#     Keep this separate from the 20 KB long-lived voice task. ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- lwIP TCP: triple the send buffer + window to 16 KB (default 5760 B). A
#     Wi-Fi RTT spike must be absorbed, not surfaced as a would-block that the
#     L2 framer would otherwise have to treat as backpressure. PSRAM is
#     plentiful so the per-socket memory is free. ---
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384

# --- Keep Wi-Fi/lwIP socket payloads in the 8 MB PSRAM first. The diagnostics
#     server and Gemini WSS can be active together; leaving lwIP on the small
#     internal heap made a few cockpit clients starve AES and stall response
#     bodies even though PSRAM was mostly idle. Internal RAM remains the
#     supported fallback. ---
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Preserve a contiguous internal-RAM pool for the 20 KB voice owner, the
#     Gemini WebSocket worker, codec DMA, and hardware AES. General allocations
#     already have 8 MB of PSRAM; consuming this pool for ordinary mallocs made
#     late-created real-time tasks fail despite ample total memory. ---
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# --- BT/BLE OFF. BT/Wi-Fi coex time-slices the single 2.4 GHz radio and
#     starves WSS streaming audio; a boot-stability + audio invariant
#     (hardware.md #11). ---
CONFIG_BT_ENABLED=n

# --- Coredump to flash. Persists panic backtraces across reboot into the
#     coredump partition — a debugging asset worth keeping (harvest list). ---
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# --- NOTE: the CONFIG_ESP_BOARD_PERIPH_* / CONFIG_ESP_BOARD_DEV_DISPLAY_LCD
#     symbols (I2C/SPI/GPIO/I2S/display support) are OWNED by esp_board_manager
#     (>=0.5.15) and are generated into components/gen_bmgr_codes/
#     board_manager.defaults from boards/.../sdkconfig.defaults.board by
#     `idf.py gen-bmgr-config`. Declaring them here is REJECTED as a managed-
#     symbol collision — so they intentionally do NOT appear in this file. ---

# --- Log levels: INFO default, DEBUG available for bring-up. ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- mbedTLS allocates from PSRAM (v4-proven). Internal heap cannot host the
#     ~45 KB TLS handshake alongside voice+display+http: observed live as
#     mbedtls_ssl_setup -0x7F00 (ALLOC_FAILED) on every Gemini WSS connect. ---
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# --- WiFi/LWIP internal-RAM tuning. THESE MUST LIVE HERE, NOT ONLY IN sdkconfig.
#
#     Recovered 2026-07-19 after `idf.py set-target` (RECONFIGURE=1) silently
#     reverted them to Kconfig defaults and cost ~16 KB of internal RAM, taking
#     free internal from 22,771 B to 6,467 B and the largest contiguous block
#     from 13,824 B to 2,432 B. The Gemini TLS handshake needs DMA-capable
#     INTERNAL memory (esp-aes), so that is the difference between a working
#     voice path and 'esp-aes: Failed to allocate memory'.
#
#     They had been tuned by hand directly in `sdkconfig`, which is GITIGNORED
#     (.gitignore) — so the tuning was invisible to git, unreviewable, and one
#     reconfigure away from silent loss. Declaring them here makes the build
#     reproducible from a clean checkout. Do not remove them without measuring
#     largest_internal_block via /api/diag/tasks first.
#
#     Static RX buffers dominate: each is ~1600 B of internal RAM, so 16 -> 10
#     alone is ~9.6 KB. RX_BA_WIN must stay <= STATIC_RX_BUFFER_NUM. ---
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4

# --- Task introspection for the internal-RAM budget work (Phase 2).
#     Largest contiguous INTERNAL block is the binding constraint on this board:
#     the Gemini TLS handshake fails ('esp-aes: Failed to allocate memory') once
#     it drops under ~8 KB, because the AES accelerator needs DMA-capable
#     internal memory that PSRAM cannot serve. Trace facility + stats let
#     /api/diag/tasks report per-task stack high-water marks so stacks are
#     right-sized from MEASUREMENT rather than guesswork.
#     Cost is a few hundred bytes of internal RAM; it pays for itself many times
#     over. See docs/JARVISNANO_OS_PLAN.md "Internal RAM budget". ---
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
